Revit 2026 API

# StructuralAssetThermalExpansionCoefficient Property

---

The thermal expansion coefficient of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ThermalExpansionCoefficient { get; set; }
```
```vb
Public Property ThermalExpansionCoefficient As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ ThermalExpansionCoefficient {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member ThermalExpansionCoefficient : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InapplicableDataException | When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic. |

This property cannot be used to set the thermal expansion coefficient for wood-based and isotropic materials. For such assets, use setThermalExpansionCoefficient instead. The value is in inverse Kelvin (1/K).

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace